app/controllers/articles_controller.rb

  def index
    @articles = Article.all
---
SELECT "articles".* FROM "articles"

  def create
    @article = Article.new(article_params)
    @article.user_id = current_user.id
    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "第一篇文章"], ["content", "第一篇文章"], ["created_at", "2017-12-06 14:03:02.990372"], ["updated_at", "2017-12-06 14:03:02.990372"], ["user_id", 1]]

  def creat_comment
    if params[:comment][:content].presence
      @comment = Comment.new
      @comment.user_id = current_user.id
      @comment.source_id = params[:comment][:source_id]
      @comment.content = params[:comment][:content]
      @comment.save
---
INSERT INTO "comments" ("user_id", "source_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["source_id", 1], ["content", "第二条评论"], ["created_at", "2017-12-06 15:04:27.262859"], ["updated_at", "2017-12-06 15:04:27.262859"]]

    def set_article
      @article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]