app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "auth_token") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    user = User.new(user_params)
    user.save

SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "wen"], ["LIMIT", 1]]
---
  def sign_in
    user = User.find_by_name(params[:name])